In [1]:
import pandas as pd

In [2]:
data = pd.Series([1,2,3,4,5,3.2])

In [3]:
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    3.2
dtype: float64

In [4]:
data1 = pd.Series([1,2,3,4,5])

In [5]:
data1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
data1.values

array([1, 2, 3, 4, 5], dtype=int64)

In [7]:
data1.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
data1[1]

2

In [9]:
data1[0:4:2]

0    1
2    3
dtype: int64

In [10]:
df = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [11]:
df

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
df['b']

2

In [14]:
popu_dict = {'bharathi': 25,'ram':26,'geeta':23}

In [15]:
b = pd.Series(popu_dict)

In [16]:
b

bharathi    25
ram         26
geeta       23
dtype: int64

In [17]:
area_dict = {'b': 25,'r':26,'g':23}

In [18]:
c = pd.Series(area_dict)

In [19]:
c

b    25
r    26
g    23
dtype: int64

In [26]:
d = pd.DataFrame({'area':c,'population':b})

In [27]:
d

          area  population
b         25.0         NaN
bharathi   NaN        25.0
g         23.0         NaN
geeta      NaN        23.0
r         26.0         NaN
ram        NaN        26.0

In [28]:
d.index

Index(['b', 'bharathi', 'g', 'geeta', 'r', 'ram'], dtype='object')

In [29]:
d.columns

Index(['area', 'population'], dtype='object')

In [30]:
d.shape

(6, 2)

In [35]:
d['area']

b           25.0
bharathi     NaN
g           23.0
geeta        NaN
r           26.0
ram          NaN
Name: area, dtype: float64

In [36]:
d.area

b           25.0
bharathi     NaN
g           23.0
geeta        NaN
r           26.0
ram          NaN
Name: area, dtype: float64

In [40]:
'geeta' in d

False

In [41]:
data1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [45]:
data1[(data1>2)|(data1<5)]#masking

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
data1[(data1>2)&(data1<5)]#masking

2    3
3    4
dtype: int64

In [47]:
data1[[1,4]] #fancy indexing

1    2
4    5
dtype: int64

In [48]:
data1.loc[1]

2

In [49]:
data1.loc[1:3]

1    2
2    3
3    4
dtype: int64

In [50]:
data1.iloc[1]

2

In [51]:
data1.iloc[1:3]

1    2
2    3
dtype: int64

SyntaxError: invalid non-printable character U+00A0 (1799566180.py, line 2)

In [55]:
d

          area  population
b         25.0         NaN
bharathi   NaN        25.0
g         23.0         NaN
geeta      NaN        23.0
r         26.0         NaN
ram        NaN        26.0

In [57]:
d['area'].fillna(15,inplace = True) #reaplacing null values

In [58]:
d

          area  population
b         25.0         NaN
bharathi  15.0        25.0
g         23.0         NaN
geeta     15.0        23.0
r         26.0         NaN
ram       15.0        26.0

In [59]:
d['population'].fillna(16,inplace = True) #replacing null values using fillna

In [60]:
d

          area  population
b         25.0        16.0
bharathi  15.0        25.0
g         23.0        16.0
geeta     15.0        23.0
r         26.0        16.0
ram       15.0        26.0

In [61]:
d['density']=d['area']/d['population'] # adding new column

In [62]:
d

          area  population   density
b         25.0        16.0  1.562500
bharathi  15.0        25.0  0.600000
g         23.0        16.0  1.437500
geeta     15.0        23.0  0.652174
r         26.0        16.0  1.625000
ram       15.0        26.0  0.576923

In [63]:
d.values

array([[25.        , 16.        ,  1.5625    ],
       [15.        , 25.        ,  0.6       ],
       [23.        , 16.        ,  1.4375    ],
       [15.        , 23.        ,  0.65217391],
       [26.        , 16.        ,  1.625     ],
       [15.        , 26.        ,  0.57692308]])

In [64]:
d.T #transpose of a matrix interchange of rows into columns and vice versa.

                  b  bharathi        g      geeta       r        ram
area        25.0000      15.0  23.0000  15.000000  26.000  15.000000
population  16.0000      25.0  16.0000  23.000000  16.000  26.000000
density      1.5625       0.6   1.4375   0.652174   1.625   0.576923

In [66]:
d

          area  population   density
b         25.0        16.0  1.562500
bharathi  15.0        25.0  0.600000
g         23.0        16.0  1.437500
geeta     15.0        23.0  0.652174
r         26.0        16.0  1.625000
ram       15.0        26.0  0.576923

In [69]:
d.iloc[:3,:2]# extracting by index location by rows and columns

          area  population
b         25.0        16.0
bharathi  15.0        25.0
g         23.0        16.0

In [71]:
d.loc[:'bharathi',:'population'] #extrating on upto the location by rows and coloumns

          area  population
b         25.0        16.0
bharathi  15.0        25.0